const n=`---
date: 2025-06-19
updated: 2025-08-19
category: 想法
summary: 实习随笔
---

## 10

学校开学喽







---

## 9

倒数25天，好欸。

改一个后端自定义动态列，优化了3版，原版从各方面来说都是第二优的，但是最好的版本也没有优化很多，太痛苦了，不过好像mentor 能交给我的任务也没有多少了，还剩3周半，差不多边边角角我就可以提桶跑路了。但是好像没学到关键的技术，也就MVVM规范格式，Prism 总线通信，订阅发布者模式、事件约束通信，程序还一大堆静态类(mentor 搞的)，不过我写的 Adb 和 c# 集成的 “FastApi” 接口功能实现类也是静态类欸，抱歉我是蠢蛋……

祝自己好运吧，相信光，就如同下图的希尔达一样(ง •̀_•́)ง







---

## 8



倒计时32天，唔，上班真的痛苦(╥﹏╥)



**构建网站的第一天**  (๑˃̵ᴗ˂̵)

![first](./../../public/assets/first.png)

当时就是脑子一热，在要找实习，作业一大堆，压力很大的时候，抽时间写的🥲。



---

## 7



新的一周喽

周四，加班一个小时，太痛苦 了



🌹(●'◡'●)🌹

Tell Me👏 Tell Me👏 

鏡👏よ鏡👏 

一番👏好きな👏私👏👏になるの👏👏 

Tell Me👏 Tell Me👏 

鏡👏よ鏡👏👏 

一番👏好きな👏私👏になるの👏👏 👏 ···👏👏 👏···👏👏 👏👏👏

![跟我走](./../../public/assets/6401f34176d51110206334a8a16c68ccbb23ac68.png) ![好耶](./../../public/assets/8fa94957d7f0a0668f3a84435e48f7aae1a9e653.png)



感觉被mentor当苦力使了，任务很多，有时间把觉得记录的知识记录下来。

好像实习后想读研的想法越来越强烈，我能深刻的感受到，实习的内容，mentor 让我完成的内容是我本科都学过的，包括操作系统层面的多线程、线程池，异步、同步；函数调用、回调；运行时内存的加载回收；MVVM模式的规范，解耦，面向对象的编程；MySQL， 索引，自然连接；系统设计模式，订阅发布者模式；处理临界区间的操作。

我想，如果我以我现在的见识，现在的知识就出来，我顶多是现在的Plus 版本而已，我难以到达更高的高度了。

另一方面，我真的还是不能接受，我的大学生活还没有很值得我纪念的人、事，我的青春就这样草草结束，我不能接受…….

嗯，对，好好复习吧，(๑•́ ₃ •̀๑) 虽然现在每天都只有晚上


---

## 6



第六周，新的一周还是有计划要好一些了，不要没有安排了。

这周安排的任务应该是三部分：

> 订阅发布模式遮罩效果的文件格式统一
>
> Resource 的 convert 返回优化
>
> 引用的样式文件重新管理

全是杂活呢

**整理**

> 订阅发布者模式、4个异步执行（需要很详细，记录具体的实例）
>
> （看时间吧）整理c# 包括 xaml  的具体组件的使用，和导航切换的方法

我还是不想本科就直接出来工作，仅此而已好好努力吧(✿◠‿◠) 



$\\color {red} {球球了}$ 总公司聚会实习生可以不去，我是真不想 就那么点工资还出差┗( T﹏T )┛ 

新的一周又开始了，倒计时 7 周后就解放了，好好加油吧，牛马。



偷张25年洛天依生贺图片



![lty](./../../public/assets/lty.png)

本来以为要改好久的代码，一天哐哐哐就改完了，然后mentor 出差疯狂摸鱼

![小豆泥(2)](./../../public/assets/小豆泥(2).gif)

哈哈哈(づ ●‿● )づ✧   

但是复习，感觉操作系统和线代还是需要一些时间的，摸鱼抽些时间复习吧。最近有台风就骑不了自行车了，早高峰打车好麻烦了





---

## 5

![0721](./../../public/assets/0721.jpg)

![小黑1](./../../public/assets/小黑1.jpg)

![小黑2](./../../public/assets/小黑2.jpg)

很幸运，能遇见小黑了(づ ●‿● )づ✧

周一，任务量还行，是我自己哐哐地敲代码，哈哈哈。

await 、Task.run() 还是没有完全弄懂，明天摸鱼，好好整理吧。

救命，周二，一整天，就维修好一点BUG ，感觉mentor 要diss 我 了

没事(╥﹏╥)



![花熏](./../../public/assets/花熏.png)



好欸，又活了一周，这周任务量稍微有点大了，主要是发布订阅者模式实现弹窗主窗体遮罩效果，还行。、

嘿嘿，mentor 会间周出差，下周又差不多可以狠狠摸鱼了。 



---

## 4

(◕‿◕✿)  苦逼的一周又开始喽🥲

哈哈哈，实习没学到多少东西，复习进度也迟缓，但是吃鸡超级王牌了 ( ͡° ͜ʖ ͡°)

(╥﹏╥)  最近就像时间加速了一样，都过得还快，明明才上班没多久，就下班了，明明还没好好享受晚上自己的时间，一下就12点了，睡一觉又循环，骑自行车18分钟到公司，买一个馒头一个茶叶蛋，吃完，摸摸鱼，一下就中午，然后下午和 mentor 对接对接任务，就 6 点下班。骑自行车回家，点外卖，刷会儿视频，打一下游戏，复习，结束……

![小豆泥(3)](./../../public/assets/小豆泥(3).gif)

(●ˊωˋ●) 救命，谁上班了，事情很多，还一直优化没啥用的博客样式呀

骗子 vercel 、cursor 国区好像都受限了，好多数据库也受限的，supabase 千万不要也凉了呀┗( T﹏T )┛

周四，涉及设备的异步执行，我真的头大，感觉别人写好的代码一坨屎，我能感受到写得很多BUG ，但是我就是不知道要怎么改。

周五，好欸，摸鱼划水又过一天

![0719](./../../public/assets/0719.jpg)

小黑电影上线了好欸！！！

真的超级好看



---

## 3

周一任务是对运行功能的抽象，记录在数据库中，进而生成测试用例库，需要满足读取时能够再次调用参数运行，但是大多参数都很多，40多个功能，分几类参数抽象，还是没有很轻松。

周二还行，虽然没给我什么任务。学习了 prism 的委托、委托的抽象接口，感觉很像 Java 欸，甚至感觉就在写 Java ,还有 viewModel 、 view 通过 prism 自动对接和处理数据 (contextData)。

明天上班的时候摸鱼整理吧

稍微有点迷茫，上班完全没有精神上获得什么，只有越来越累，越来越觉得很烦，我要考研，要读研又是为了什么啊。与mentor 交流 实例化 委托的对象的时候，为什么要用 抽象的ICommand、为什么用 DelegateCommand，第一次感受到，那种 “我是程序员啊”， 上学的时候和同学讨论，或者自己写代码，一直给我的感觉是，我在做一件事，我在写作业，我在小组讨论，我在借用 chatGPT 放大我的想法，就是没有感受到过，我是一个开发者……

很“有幸 ？”，我有了这种感觉？

摸鱼，感觉现在很奇怪欸，敲键盘，哪怕是在复习也不是很困，但是只要是单纯的用草稿纸，10分钟就困得不行了。

第三周也结束了，感觉也没啥好回顾的，上班而已。之前看干物妹小埋的时候很疑惑为什么哥哥周末会干坐没事做，呜呜呜，周六也真真实实的体会到了为什么了。平常都是由工作充斥着，甚至不太会安排自己的周末了，想好好休息，但是闲下来很不舒服，就无所事事。

突然间感觉很疑惑， 为什么我们都是看着远方自己还未得到的东西，努力着奔向远方，承受着当下的“苟且”，“好好努力，考好期末、考上好的中学、考上好的大学、努力保研、考研……努力找一个好的工作，然后我还没体验，但是好像是好好工作、买车买房、还房贷车贷、结婚”，所以一场“修炼”结束，然后无缝衔接下一场吗？

—— 好像人生本来就是需要这样吧，否则像工作日上班后周末无所事事吗？因为我的眼光太聚焦我未来想要得到的东西，却忽略了现在也是我一步步努力的来的生活，却忽略了好多快乐的时刻……初中语文老师说的话，到如今只记得一句话，“也许人生的意义就是一场漫长的体验之旅”，今年 2 月底疯狂的投简历，找实习，一直被拒，甚至感觉怀疑人生，然后 6月12号下午收到 offer ，不是也是一场很值得记录的体验吗，我确实很厉害、很值得夸赞，但是我的缺点，机试很差，这让我足足上了 3 个半月的课，

![record0713](./../../public/assets/record0713.png)

我有好好地回应一个多月前的对话的吧。

现在再留下一个隔空对话吧  2025年 9 月 13 号的我

应该9月12号实习结束，当晚带一部分行李回学校了，然后第二天会出租屋收拾剩下的行李吧，下午回到学校，晚上就回到正常的大学生活了吧，啊救命，特别硬的床，特别难吃的饭 (๑•́ ₃ •̀)  。

祝你好运，也祝我好运。(づ ●‿● )づ✧



---

## 2

又是周五，晚上在阳台吹吹风，看看落日。还挺不错

这周基于 WPF 框架 的 MVVM 模式写了控制手机的 adb 工具，并做了可视化，等向下周向 mentor， 展示、优化后偷来丢在 GitHub 的仓库里吧。

mentor 给的任务好抽象啊，代码还没给我看，架构没给我看，测试代码没给我看，就给了测试的功能设计说明，叫我设计测试功能的日志记录抽象设计，真就抽象设计，哈哈哈，就记录， 功能参数，返回内容，三点抽象，结束。

 chat 快快加油吧 ，高级算法的作业快帮我做完🥺 。

写完高级算法作业就可以暂时 好好休息一下喽！



---

## 1

第一周： 感觉很多都是在干打杂，虽然也没有期望什么，更多的是体验吧，还拿到实习证明，就OK了。

实习内容累倒是不累，但是每天通勤啊，实习第一个月没多少钱啊，一个人租房没人一起玩啊……累、不舒畅的感觉倒是来源于这些方向(´･_･\`)。

对**还有作业、论文、报告没写完**， 这就太痛苦了。

学习到的东西呢：

- 公司里的分工、交流都太细、太完善了，好难看清全局
- mentor 一直 是有dll 库， 有开源包可以用吗
- “你先写好一个小 demo 展示”
- 还行，现阶段还比较简单，对我来说能实现

具体的点（详细只是记录文档写在其他文章了）



> WPF 架构、dll 动态链接库的调用、adb

---

`;export{n as default};
