const n=`---
date: 2025-10-07
updated: 2025-10-07
category: 考研复习
summary: 数据结构5树与二叉树6图
---
## 5.树

![树基本概念](./../../public/assets/数据结构/树基本概念.png)

![树的性质1](./../../public/assets/数据结构/树的性质1.png)

![树的性质2](./../../public/assets/数据结构/树的性质2.png)



### 二叉树

#### 定义

![二叉树](./../../public/assets/数据结构/二叉树.png)

#### 满二叉树、完全二叉树

![满二叉树](./../../public/assets/数据结构/满二叉树.png)

#### 二叉排序树

![二叉排序树](./../../public/assets/数据结构/二叉排序树.png)

#### 平衡二叉树

![平衡二叉树](./../../public/assets/数据结构/平衡二叉树.png)

#### 正则二叉树

> 二叉树前序、中序、后序遍历

#### 线索二叉树

> 中序线索化

![中序线索化](./../../public/assets/数据结构/中序线索化.png)

> 先序线索化

![先序线索化](./../../public/assets/数据结构/先序线索化.png)

### 树、森林



### 树的应用

#### 哈夫曼树



#### 并查集



#### 堆













## 6.图

`;export{n as default};
