const n=`---
date: 2025-09-18
updated: 2025-09-18
category: 考研复习
summary: 计算机组成原理6总线和7输入输出系统

---

## 总线概述

![总线概念及分类](./../../public/assets/计组/总线概念及分类.png)

### 概念

![总线的定义](./../../public/assets/计组/总线的定义.png)

### 分类

> 按功能层次分类

![功能层次分类总线](./../../public/assets/计组/功能层次分类总线.png)

> 按数据传输方式分类

![数据传输方式总线](./../../public/assets/计组/数据传输方式总线.png)

> 按时序控制方式分类

### 总线结构

#### 单总线结构

![单总线结构](./../../public/assets/计组/单总线结构.png)

#### 双总线结构

![双总线结构](./../../public/assets/计组/双总线结构.png)

#### 三总线结构

![三总线结构](./../../public/assets/计组/三总线结构.png)





## 总线性能指标

![总线性能指标1](./../../public/assets/计组/总线性能指标1.png)

![总线性能指标2](./../../public/assets/计组/总线性能指标2.png)

![总线性能指标3](./../../public/assets/计组/总线性能指标3.png)





## 总线事务和定时



### 总线事务

![总线事务](./../../public/assets/计组/总线事务.png)

### 总线定时

![总线定时](./../../public/assets/计组/总线定时.png)

#### 同步定时方式

![同步定时方式1](./../../public/assets/计组/同步定时方式1.png)

![同步定时方式2](./../../public/assets/计组/同步定时方式2.png)

#### 异步定时方式

![异步定时方式1](./../../public/assets/计组/异步定时方式1.png)

![异步定时方式2](./../../public/assets/计组/异步定时方式2.png)

#### 半同步通信

![半同步通信](./../../public/assets/计组/半同步通信.png)

#### 分离式通信

![分离式通信](./../../public/assets/计组/分离式通信.png)







## IO接口



### IO接口功能

![IO接口功能](./../../public/assets/计组/IO接口功能.png)

### IO接口基本结构

![IO接口的基本结构哦](./../../public/assets/计组/IO接口的基本结构哦.png)

### IO接口类型

![IO接口类型](./../../public/assets/计组/IO接口类型.png)

### IO端口及其编址

>  IO端口：IO接口电路中可被CPU直接访问的寄存器，主要有数据端口、状态端口、控制端口。

![IO接口及其编址](./../../public/assets/计组/IO接口及其编址.png)



## IO方式



### 程序查询方式

![程序查询方式](./../../public/assets/计组/程序查询方式.png)

![程序查询流程图](./../../public/assets/计组/程序查询流程图.png)

### 中断方式

#### 作用和原理



#### 工作流程

##### 中断请求

![中断请求](./../../public/assets/计组/中断请求.png)

![中断请求分类](./../../public/assets/计组/中断请求分类.png)

##### 中断响应判优

![中段判优实现](./../../public/assets/计组/中段判优实现.png)

![中断优先级设置](./../../public/assets/计组/中断优先级设置.png)

##### CPU响应中断条件



##### 中断响应过程

> 中断隐指令

![中断响应过程](./../../public/assets/计组/中断响应过程.png)

![中断服务程序](./../../public/assets/计组/中断服务程序.png)



##### 中断处理过程

![中断处理过程](./../../public/assets/计组/中断处理过程.png)



#### 多重中断

![单重中断和多重中断](./../../public/assets/计组/单重中断和多重中断.png)

![中断屏蔽字](./../../public/assets/计组/中断屏蔽字.png)

![中断屏蔽字例子](./../../public/assets/计组/中断屏蔽字例子.png)

#### 程序中断

![程序中断方式](./../../public/assets/计组/程序中断方式.png)

### DMA方式

![DMA方式](./../../public/assets/计组/DMA方式.png)

#### 组成

![DMA控制器1](./../../public/assets/计组/DMA控制器1.png)

#### 结构

![DMA控制器2](./../../public/assets/计组/DMA控制器2.png)

#### 传送过程

![DMA传送过程](./../../public/assets/计组/DMA传送过程.png)

#### 传送方式（总线占用）

![DMA传送方式](./../../public/assets/计组/DMA传送方式.png)

#### DMA方式与中断对比

![DMA方式和中断方式](./../../public/assets/计组/DMA方式和中断方式.png)





## 常见问题和易混淆点

### 1.并行总线和串行总线

并行总线不一定比串行总线传输速度快。

时钟频率的提高，干扰增强



### 2.IO指令

> IO指令实现的数据传送通常发生在通用寄存器和IO端口之间



### 3.异常事件和中断事件的检测时间

> 异常事件：指令执行过程中
>
> 中断事件：执行完一条指令
`;export{n as default};
