const n=`---
date: 2025-09-18
updated: 2025-09-18
category: 考研复习
summary: 计算机组成原理5中央处理器

---

## 大纲

![中央处理器](./../../public/assets/计组/中央处理器.png)



## CPU的功能和基本结构

### 功能

![CPU功能](./../../public/assets/计组/CPU功能.png)

### CPU基本结构

![CPU基本结构](./../../public/assets/计组/CPU基本结构.png)





### 运算器

![运算器的基本结构](./../../public/assets/计组/运算器的基本结构.png)

### 控制器

![控制器的基本结构](./../../public/assets/计组/控制器的基本结构.png)



> 寄存器是否可见

![寄存器可见与不可见](./../../public/assets/计组/寄存器可见与不可见.png)





## 指令执行过程

### 指令周期

![指令周期](./../../public/assets/计组/指令周期.png)

### 指令周期流程

![指令周期流程](./../../public/assets/计组/指令周期流程.png)

### 取指周期

![指令周期取指周期](./../../public/assets/计组/指令周期取指周期.png)

### 中断周期

![指令周期中断周期](./../../public/assets/计组/指令周期中断周期.png)

### 指令执行方案

![指令执行方案](./../../public/assets/计组/指令执行方案.png)





## 数据通路

> 内部总线与系统总线的区别

### 单总线方式

![CPU内部单总线](./../../public/assets/计组/CPU内部单总线.png)



![单总线例子](./../../public/assets/计组/单总线例子.png)

### 专用数据通路方式

![专用数据通路](./../../public/assets/计组/专用数据通路.png)





## 控制器

### 硬布线控制器

![硬布线控制器](./../../public/assets/计组/硬布线控制器.png)

![硬布线控制器特点](./../../public/assets/计组/硬布线控制器特点.png)

### 微程序控制器

![微程序控制器1](./../../public/assets/计组/微程序控制器1.png)

![微程序控制器](./../../public/assets/计组/微程序控制器.png)



![微程序控制器工作原理](./../../public/assets/计组/微程序控制器工作原理.png)

### 微指令的设计

![微指令设计](./../../public/assets/计组/微指令设计.png)

#### 格式

![微指令格式](./../../public/assets/计组/微指令格式.png)

#### 编码方式

> 直接编码、字段直接编码、字段间接编码

![微指令编码方式1](./../../public/assets/计组/微指令编码方式1.png)

![微指令编码方式2](./../../public/assets/计组/微指令编码方式2.png)

#### 地址形成方式

![微指令地址形成方式](./../../public/assets/计组/微指令地址形成方式.png)

#### 对比

![硬布线和微程序](./../../public/assets/计组/硬布线和微程序.png)



## 指令流水线

![指令流水线](./../../public/assets/计组/指令流水线.png)

### 指令流水线基本概念



### 流水线的性能指标

#### 吞吐率

![流水线的性能指标1](./../../public/assets/计组/流水线的性能指标1.png)

#### 加速比

![流水线的性能指标2](./../../public/assets/计组/流水线的性能指标2.png)

#### 效率

### 流水线的冒险与处理

![流水线影响因素](./../../public/assets/计组/流水线影响因素.png)

#### 结构冒险



#### 数据冒险



#### 控制冒险



### 流水线分类



### 流水线多发



## 多处理器

> SISD、SIMD、MISD、MIMD

![多处理器基本概念](./../../public/assets/计组/多处理器基本概念.png)

![多核处理器和共享内存](./../../public/assets/计组/多核处理器和共享内存.png)

### 向量处理器

![向量处理器](./../../public/assets/计组/向量处理器.png)

### 硬件多线程

![硬件多线程1](./../../public/assets/计组/硬件多线程1.png)

![硬件多线程2](./../../public/assets/计组/硬件多线程2.png)





## 常见问题和易混淆点



### 1.采用指令Cache和数据Cache分离的主要目的是

> 减少指令流水线的资源冲突



`;export{n as default};
